#Область ПрограммныйИнтерфейс

// Обработать отчет об ошибке. 
// Разбирает двоичные данные архива и создает из него "Ошибку" 
// 
// Параметры:
//  ДанныеОтчета - ДвоичныеДанные -Двоичные данные архива (.zip) с данными ошибки 
Процедура ОбработатьОтчетОбОшибке(ДанныеОтчета) Экспорт
	
	ИнформацияОтчетаСтруктура 	= ПолучитьИнформациюИзОтчета(ДанныеОтчета);
	СтруктураОтчета = ИнформацияОтчетаСтруктура.ReportStructure;
	ПоляОшибки = Константы.ОшибкаПоУмолчанию.Получить().Получить();
	
	Если СтруктураОтчета = Неопределено Тогда
		ВызватьИсключение("Не удалось разобрать протокол ошибки!");	
	КонецЕсли;
	
	Project = СтруктураОтчета.configInfo.name;
	
	ОшибкаМассив =  СтруктураОтчета.errorInfo.applicationErrorInfo.errors;
	Если ОшибкаМассив.Количество() И ЗначениеЗаполнено(ОшибкаМассив[0][0]) Тогда	
		SourceInformation = ОшибкаМассив[0][0];
		Description = ПолучитьСтрокуМетаданных(ОшибкаМассив[0][0]);
	Иначе
		ВызватьИсключение("Не заполнен текст ошибки!");	
	КонецЕсли;
	
	Если СтруктураОтчета.Свойство("additionalInfo") Тогда // Доп инфомрация - она же идентификатор клиента
		Description = СтруктураОтчета.additionalInfo + " " + Description;	
	КонецЕсли;
	
	StepsToReproduce = "";
	Если СтруктураОтчета.errorInfo.Свойство("userDescription") Тогда
		StepsToReproduce = СтруктураОтчета.errorInfo.userDescription;
	КонецЕсли;
	
	ВерсияПроекта = СтруктураОтчета.configInfo.version;
	ProjectVersion = Справочники.ВерсииПроекта.ПолучитьВерсиюПроектаПоНомеру(Project, ВерсияПроекта);
	Если ProjectVersion = Неопределено Тогда
		ВызватьИсключение("Не удалось найти версию проекта: " + ВерсияПроекта);
	КонецЕсли;
	Assembly = Строка(Справочники.СборкиВерсии.ФинальнаяСборкаВерсии(ProjectVersion)); 
	Если Assembly = Неопределено Тогда
		ВызватьИсключение("Не удалось найти финальную сборку!");	
	КонецЕсли;
	
	Urgency = Перечисления.СрочностьИсправленияОшибок.ВПлановомПорядке;
	DetectionType = Перечисления.МетодыВыявленияОшибок.РаботаСПрограммой;
	Responsible = ПоляОшибки.Кому;
	
	ТаблицаМетаданных = ИнтеграцияСВнешнимиСистемами.ПолучитьТаблицуМетаданных();
	ОбъектыМетаданных = ИнтеграцияСВнешнимиСистемами.НайтиОбъектыМетаданных(ТаблицаМетаданных, Project);
	ПараметрыОшибки   = ИнтеграцияСВнешнимиСистемами.ИнициироватьПараметрыОшибки();
	
	ПараметрыОшибки.ИмяПроекта               = Project;
	ПараметрыОшибки.Наименование             = Description;
	ПараметрыОшибки.Сборка             		 = Assembly;
	ПараметрыОшибки.МетодВыявленияОшибки     = DetectionType;
	ПараметрыОшибки.ИсходнаяИнформация       = SourceInformation;
	ПараметрыОшибки.ПорядокВоспроизведения   = StepsToReproduce;
	ПараметрыОшибки.ДатаОбнаружения          = ТекущаяДатаСеанса();
	ПараметрыОшибки.ВерсияПроекта            = ProjectVersion;
	ПараметрыОшибки.СрочностьИсправления     = Urgency;
	ПараметрыОшибки.КомуНаправлена           = Responsible;
	ПараметрыОшибки.ОшибкаЗарегистрированаПоИнформацииОтВнешнихИсточников = Истина;
	
	Результат = ИнтеграцияСВнешнимиСистемами.ЗарегистрироватьОшибку(ПараметрыОшибки, ОбъектыМетаданных);   
	Если Результат.СсылкаНаОшибку = Неопределено Тогда
		ВызватьИсключение "Не удалось создать ошибку!";	
	КонецЕсли;

	РаботаСФайлами.ЗагрузитьДвоичныеДанныеВФайлы(ДанныеОтчета, "Ошибка_"+Формат(ТекущаяДатаСеанса(), "ДФ=dd_MM_yyyy;"), ".zip", Результат.СсылкаНаОшибку);
	
КонецПроцедуры

// Перекомпоновать zip. Для моментов когда данные передаются в виде Multipart 
// 
// Параметры:
//  ДанныеОтчета - двоичные данные - Данные отчета 
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Данные нового zip архива
Функция ПерекомпоноватьZip(ДанныеОтчета) Экспорт

    ЧтениеZip = Новый ЧтениеZipФайла(ДанныеОтчета.ОткрытьПотокДляЧтения());
    ПотокНовогоАрхива = Новый ПотокВПамяти;
    ЗаписьZip = Новый ЗаписьZipФайла(ПотокНовогоАрхива);

    ПутьКПапке = КаталогВременныхФайлов() + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
    СоздатьКаталог(ПутьКПапке);
    
    ЧтениеZip.ИзвлечьВсе(ПутьКПапке, РежимВосстановленияПутейФайловZIP.Восстанавливать);

    Для Каждого Элемент Из ЧтениеZip.Элементы Цикл
        
        ПолныйПутьНаДиске = ПутьКПапке + ПолучитьРазделительПути() + Элемент.ПолноеИмя;
        ЗаписьZip.Добавить(ПолныйПутьНаДиске, РежимСохраненияПутейZIP.СохранятьОтносительныеПути);
        
    КонецЦикла;

    ЗаписьZip.Записать(); 
    ЧтениеZip.Закрыть();

    УдалитьФайлы(ПутьКПапке);

    Возврат ПотокНовогоАрхива.ЗакрытьИПолучитьДвоичныеДанные();
    
КонецФункции

// Прочитать сообщение Multipart.
// Разбирает ответ сервера формата Multipart. Т.к. 1С по умолчанию не может его читать.
// 
// Параметры:
//  Заголовки - ЗаголовокHTTP - Заголовок http запроса 
//  Тело - ДвоичныеДанные - Двоичные данные формата form-data 
// 
// Возвращаемое значение:
//  ДвоичныеДанные - ДвоичныеДанные нового разобранного архива
Функция ПрочитатьСообщениеMultipart(Заголовки, Тело) Экспорт
	
	Данные = Тело;
	
	Разделитель = ПолучитьРазделительСоставногоСообщения(Заголовки);
	Если Разделитель <> Неопределено Тогда	
		Маркеры = Новый Массив();
		Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки("--" + Разделитель));
		Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки("--" + Разделитель + Символы.ПС));
		Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки("--" + Разделитель + Символы.ВК));
		Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки("--" + Разделитель + Символы.ВК + Символы.ПС));
		Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки("--" + Разделитель + "--"));
				
		ЧтениеДанных = Новый ЧтениеДанных(Тело);
			
		// Переходим к началу первой части
		ЧтениеДанных.ПропуститьДо(Маркеры);
		
		//Помещаем в общий буфер двоичных данных и разделяем буфер с помощью маркеров
		ОбщийБуферДвоичныхДанных = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных();
		БуферыДвоичныхДанных = ОбщийБуферДвоичныхДанных.Разделить(Маркеры);
		
		// Далее в цикле читаем все буферы
		Для Каждого Буфер Из БуферыДвоичныхДанных Цикл
			Поток = Новый ПотокВПамяти(Буфер);
			ЧтениеЧасти = Новый ЧтениеДанных(Поток);
			ЗаголовкиЧасти = ПрочитатьЗаголовки(ЧтениеЧасти);
			ИмяЧасти = ПолучитьИмяСообщения(ЗаголовкиЧасти);
			
			Если ИмяЧасти = "report" Тогда
				Данные = ЧтениеЧасти.Прочитать().ПолучитьДвоичныеДанные();			
			КонецЕсли;				
			
			ЧтениеЧасти.Закрыть();
			Поток.Закрыть();
			
			Если Данные <> Неопределено Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции


// Создать ошибку по умолчанию и возвращает ссылку на нее
// 
// Возвращаемое значение:
//  СправочникСсылка.Ошибки, Неопределено - Создать ошибку по умолчанию и возвращает ссылку на нее
Функция СоздатьОшибкуПоУмолчанию() Экспорт
	
	ПоляОшибки = Константы.ОшибкаПоУмолчанию.Получить().Получить();
	
	Urgency = Перечисления.СрочностьИсправленияОшибок.ВПлановомПорядке;
	DetectionType = Перечисления.МетодыВыявленияОшибок.РаботаСПрограммой;
	
	ТаблицаМетаданных = ИнтеграцияСВнешнимиСистемами.ПолучитьТаблицуМетаданных();
	ОбъектыМетаданных = ИнтеграцияСВнешнимиСистемами.НайтиОбъектыМетаданных(ТаблицаМетаданных, Строка(ПоляОшибки.Проект));
	ПараметрыОшибки   = ИнтеграцияСВнешнимиСистемами.ИнициироватьПараметрыОшибки();
	
	ПараметрыОшибки.ИмяПроекта               = Строка(ПоляОшибки.Проект);
	ПараметрыОшибки.Наименование             = ПоляОшибки.Наименование;
	ПараметрыОшибки.Сборка             		 = ПоляОшибки.Сборка;
	ПараметрыОшибки.МетодВыявленияОшибки     = DetectionType;
	ПараметрыОшибки.ИсходнаяИнформация       = "";
	ПараметрыОшибки.ПорядокВоспроизведения   = "";
	ПараметрыОшибки.ДатаОбнаружения          = ТекущаяДатаСеанса();
	ПараметрыОшибки.ВерсияПроекта            = ПоляОшибки.ВерсияПроекта;
	ПараметрыОшибки.СрочностьИсправления     = Urgency;
	ПараметрыОшибки.КомуНаправлена           = ПоляОшибки.Кому;
	ПараметрыОшибки.ОшибкаЗарегистрированаПоИнформацииОтВнешнихИсточников = Истина;
	
	Возврат ИнтеграцияСВнешнимиСистемами.ЗарегистрироватьОшибку(ПараметрыОшибки, ОбъектыМетаданных);   

КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Функция возвращает строковое представление объекта метаданных
//
// Параметры:
//  ТекстОшибки  - Строка - Исходная строка текста ошибки
//
// Возвращаемое значение:
//   Строка   - Строка объекта метаданных
//
Функция ПолучитьСтрокуМетаданных(ТекстОшибки)
 
	ПерваяФигурнаяСкопка 	= СтрНайти(ТекстОшибки, Символ(123));
	ВтораяФигурнаяСкопка 	= СтрНайти(ТекстОшибки, Символ(125));
	РезультатПоиска		    = Строка(Сред(ТекстОшибки, (ПерваяФигурнаяСкопка+1), (ВтораяФигурнаяСкопка-(ПерваяФигурнаяСкопка+1)))); 
	СтрокаОбъектаМетаданных = СтрРазделить(РезультатПоиска, ".");	
	
	Возврат СтрокаОбъектаМетаданных[0] + "." + СтрокаОбъектаМетаданных[1];
	
КонецФункции

Функция ПолучитьИнформациюИзОтчета(ДанныеОтчета)
	
	Отчет 		   = Неопределено;
	ОтчетСтруктура = Неопределено;
	Скриншот 	   = Неопределено;
			
	ЧтениеZip = Новый ЧтениеZipФайла(ДанныеОтчета.ОткрытьПотокДляЧтения());
	Для Каждого Элемент Из ЧтениеZip.Элементы Цикл 
		Если Элемент.Имя = "report.json" Тогда
			ПутьКПапкеReportJson = ПолучитьИмяВременногоФайла();
			ЧтениеZip.Извлечь(Элемент, ПутьКПапкеReportJson);
			
			ЧтениеТекста = Новый ЧтениеТекста(ПутьКПапкеReportJson + ПолучитьРазделительПути() + "report.json", КодировкаТекста.UTF8);
			Отчет = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();
			
			ЧтениеJson = Новый ЧтениеJSON();
			ЧтениеJson.ОткрытьФайл(ПутьКПапкеReportJson + ПолучитьРазделительПути() + "report.json");
			ОтчетСтруктура = ПрочитатьJSON(ЧтениеJson);			
			ЧтениеJson.Закрыть();
			
			УдалитьФайлы(ПутьКПапкеReportJson);
		ИначеЕсли Элемент.Имя = "screenshot.png" Тогда
			ПутьКПапкеScreenshot = ПолучитьИмяВременногоФайла();
			
			ЧтениеZip.Извлечь(Элемент, ПутьКПапкеScreenshot);  		
			ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКПапкеScreenshot + ПолучитьРазделительПути() + "screenshot.png");
			Скриншот 	   = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
			
			УдалитьФайлы(ПутьКПапкеScreenshot);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Report, ReportStructure, Screenshot", Отчет, ОтчетСтруктура, Скриншот); 
	
КонецФункции
	
	
#Область ФункцииДляПарсингаMultipart
	
Функция ПрочитатьЗначениеЗаголовка(Заголовки, Заголовок, ЗначениеЗаголовка = Неопределено)

	Для Каждого КлючЗначение Из Заголовки Цикл
		Если НРег(КлючЗначение.Ключ) = НРег(Заголовок) Тогда
			ЗначениеЗаголовка = КлючЗначение.Значение;
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

Функция ПолучитьРазделительСоставногоСообщения(Заголовки)
	Перем Разделитель;
	
	ТипСодержимого = "";
	Если Не ПрочитатьЗначениеЗаголовка(Заголовки, "Content-type", ТипСодержимого) Тогда
		Возврат Разделитель;
	КонецЕсли;
	
	Свойства = СтрРазделить(ТипСодержимого, ";", Ложь);
        
	Для Каждого Свойство Из Свойства Цикл
		Части = СтрРазделить(Свойство, "=", Ложь);
		ИмяСвойства = СокрЛП(Части[0]);
		Если НРег(ИмяСвойства) = "boundary" Тогда
			Разделитель = СокрЛП(Части[1]);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Разделитель;
	
КонецФункции

Функция ПрочитатьЗаголовки(Чтение)
	
	Заголовки = Новый Соответствие();
	Пока Истина Цикл
		Стр = Чтение.ПрочитатьСтроку();
		Если Стр = "" Тогда
			Прервать;
		КонецЕсли;
		Части = СтрРазделить(Стр, ":");	
		
		Заголовки.Вставить(СокрЛП(Части[0]), СокрЛП(Части[1]));
	КонецЦикла;
	
	Возврат Заголовки;
		
КонецФункции

Функция ПолучитьИмяСообщения(Заголовки)
	
	Описание = Заголовки.Получить("Content-Disposition");
	Свойства = СтрРазделить(Описание, ";", Ложь);
	
	Для Каждого Свойство Из Свойства Цикл
		Части = СтрРазделить(Свойство, "=", Ложь);
		ИмяСвойства = СокрЛП(Части[0]);               
		Если ИмяСвойства = "name" Тогда
			Возврат СокрЛП(СтрЗаменить(Части[1], """", ""));       
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти	

#КонецОбласти

