#Область ПрограммныйИнтерфейс

// Обработать отчет об ошибке.
// 
// Параметры:
//  ДанныеОтчета - Двоичные данные архива (.zip, Multipart) с данными ошибки 
Процедура ОбработатьОтчетОбОшибке(ДанныеОтчета) Экспорт
	
	ИнформацияОтчетаСтруктура 	= ПолучитьИнформациюИзОтчета(ДанныеОтчета);
	СтруктураОтчета = ИнформацияОтчетаСтруктура.ReportStructure;
	
	Если СтруктураОтчета = Неопределено Тогда
		ВызватьИсключение("Не удалось разобрать протокол ошибки!");	
	КонецЕсли;
	
	Project = СтруктураОтчета.configInfo.name;
	
	ОшибкаМассив =  СтруктураОтчета.errorInfo.applicationErrorInfo.errors;
	Если ОшибкаМассив.Количество() И ЗначениеЗаполнено(ОшибкаМассив[0][0]) Тогда	
		SourceInformation = ОшибкаМассив[0][0];
		Description = ПолучитьСтрокуМетаданных(ОшибкаМассив[0][0]);
	Иначе
		ВызватьИсключение("Не заполнен текст ошибки!");	
	КонецЕсли;
	
	Если СтруктураОтчета.Свойство("additionalInfo") Тогда // Доп инфомрация - она же идентификатор клиента
		Description = СтруктураОтчета.additionalInfo + " " + Description;	
	КонецЕсли;
	
	StepsToReproduce = "";
	Если СтруктураОтчета.errorInfo.Свойство("userDescription") Тогда
		StepsToReproduce = СтруктураОтчета.errorInfo.userDescription;
	КонецЕсли;
	
	ВерсияПроекта = СтруктураОтчета.configInfo.version;
	ProjectVersion = Справочники.ВерсииПроекта.ПолучитьВерсиюПроектаПоНомеру(Project, ВерсияПроекта);
	Если ProjectVersion = Неопределено Тогда
		ВызватьИсключение("Не удалось найти версию проекта: " + ВерсияПроекта);
	КонецЕсли;
	Assembly = Строка(Справочники.СборкиВерсии.ФинальнаяСборкаВерсии(ProjectVersion)); 
	Если Assembly = Неопределено Тогда
		ВызватьИсключение("Не удалось найти финальную сборку!");	
	КонецЕсли;
	
	Urgency = Перечисления.СрочностьИсправленияОшибок.ВПлановомПорядке;
	DetectionType = Перечисления.МетодыВыявленияОшибок.РаботаСПрограммой;
	Responsible = Константы.ПолучательОшибок.Получить();
	
	ТаблицаМетаданных = ИнтеграцияСВнешнимиСистемами.ПолучитьТаблицуМетаданных();
	ОбъектыМетаданных = ИнтеграцияСВнешнимиСистемами.НайтиОбъектыМетаданных(ТаблицаМетаданных, Project);
	ПараметрыОшибки   = ИнтеграцияСВнешнимиСистемами.ИнициироватьПараметрыОшибки();
	
	ПараметрыОшибки.ИмяПроекта               = Project;
	ПараметрыОшибки.Наименование             = Description;
	ПараметрыОшибки.Сборка             		 = Assembly;
	ПараметрыОшибки.МетодВыявленияОшибки     = DetectionType;
	ПараметрыОшибки.ИсходнаяИнформация       = SourceInformation;
	ПараметрыОшибки.ПорядокВоспроизведения   = StepsToReproduce;
	ПараметрыОшибки.ДатаОбнаружения          = ТекущаяДатаСеанса();
	ПараметрыОшибки.ВерсияПроекта            = ProjectVersion;
	ПараметрыОшибки.СрочностьИсправления     = Urgency;
	ПараметрыОшибки.КомуНаправлена           = Responsible;
	ПараметрыОшибки.ОшибкаЗарегистрированаПоИнформацииОтВнешнихИсточников = Истина;
	
	Результат = ИнтеграцияСВнешнимиСистемами.ЗарегистрироватьОшибку(ПараметрыОшибки, ОбъектыМетаданных);   
	Если Результат.СсылкаНаОшибку <> Неопределено Тогда
		ВладелецФайла = Результат.СсылкаНаОшибку; 	
	Иначе
		ВладелецФайла = Константы.ПапкаФайловДляОшибок.Получить();	
	КонецЕсли;
	НовыйАрхив = ПерекомпоноватьZip(ДанныеОтчета);
	РаботаСФайлами.ЗагрузитьДвоичныеДанныеВФайлы(НовыйАрхив, "Ошибка_"+Формат(ТекущаяДатаСеанса(), "ДФ=dd_MM_yyyy;"), ".zip", ВладелецФайла);
КонецПроцедуры

// Перекомпоновать zip. Для моментов когда данные передаются в виде Multipart 
// 
// Параметры:
//  ДанныеОтчета - двоичные данные - Данные отчета 
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Данные нового zip архива
Функция ПерекомпоноватьZip(ДанныеОтчета) Экспорт

    ЧтениеZip = Новый ЧтениеZipФайла(ДанныеОтчета.ОткрытьПотокДляЧтения());
    ПотокНовогоАрхива = Новый ПотокВПамяти;
    ЗаписьZip = Новый ЗаписьZipФайла(ПотокНовогоАрхива);

    ПутьКПапке = КаталогВременныхФайлов() + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
    СоздатьКаталог(ПутьКПапке);
    
    ЧтениеZip.ИзвлечьВсе(ПутьКПапке, РежимВосстановленияПутейФайловZIP.Восстанавливать);

    Для Каждого Элемент Из ЧтениеZip.Элементы Цикл
        
        ПолныйПутьНаДиске = ПутьКПапке + ПолучитьРазделительПути() + Элемент.ПолноеИмя;
        ЗаписьZip.Добавить(ПолныйПутьНаДиске, РежимСохраненияПутейZIP.СохранятьОтносительныеПути);
        
    КонецЦикла;

    ЗаписьZip.Записать(); 
    ЧтениеZip.Закрыть();

    УдалитьФайлы(ПутьКПапке);

    Возврат ПотокНовогоАрхива.ЗакрытьИПолучитьДвоичныеДанные();
    
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Функция возвращает строковое представление объекта метаданных
//
// Параметры:
//  ТекстОшибки  - Строка - Исходная строка текста ошибки
//
// Возвращаемое значение:
//   Строка   - Строка объекта метаданных
//
Функция ПолучитьСтрокуМетаданных(ТекстОшибки)
 
	ПерваяФигурнаяСкопка 	= СтрНайти(ТекстОшибки, Символ(123));
	ВтораяФигурнаяСкопка 	= СтрНайти(ТекстОшибки, Символ(125));
	РезультатПоиска		    = Строка(Сред(ТекстОшибки, (ПерваяФигурнаяСкопка+1), (ВтораяФигурнаяСкопка-(ПерваяФигурнаяСкопка+1)))); 
	СтрокаОбъектаМетаданных = СтрРазделить(РезультатПоиска, ".");	
	
	Возврат СтрокаОбъектаМетаданных[0] + "." + СтрокаОбъектаМетаданных[1];
	
КонецФункции


Функция ПолучитьИнформациюИзОтчета(ДанныеОтчета)
	
	Отчет 		   = Неопределено;
	ОтчетСтруктура = Неопределено;
	Скриншот 	   = Неопределено;
			
	ЧтениеZip = Новый ЧтениеZipФайла(ДанныеОтчета.ОткрытьПотокДляЧтения());
	Для Каждого Элемент Из ЧтениеZip.Элементы Цикл 
		Если Элемент.Имя = "report.json" Тогда
			ПутьКПапкеReportJson = ПолучитьИмяВременногоФайла();
			ЧтениеZip.Извлечь(Элемент, ПутьКПапкеReportJson);
			
			ЧтениеТекста = Новый ЧтениеТекста(ПутьКПапкеReportJson + ПолучитьРазделительПути() + "report.json", КодировкаТекста.UTF8);
			Отчет = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();
			
			ЧтениеJson = Новый ЧтениеJSON();
			ЧтениеJson.ОткрытьФайл(ПутьКПапкеReportJson + ПолучитьРазделительПути() + "report.json");
			ОтчетСтруктура = ПрочитатьJSON(ЧтениеJson);			
			ЧтениеJson.Закрыть();
			
			УдалитьФайлы(ПутьКПапкеReportJson);
		ИначеЕсли Элемент.Имя = "screenshot.png" Тогда
			ПутьКПапкеScreenshot = ПолучитьИмяВременногоФайла();
			
			ЧтениеZip.Извлечь(Элемент, ПутьКПапкеScreenshot);  		
			ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКПапкеScreenshot + ПолучитьРазделительПути() + "screenshot.png");
			Скриншот 	   = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
			
			УдалитьФайлы(ПутьКПапкеScreenshot);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Report, ReportStructure, Screenshot", Отчет, ОтчетСтруктура, Скриншот); 
	
КонецФункции
	

#КонецОбласти

