
Функция pushReportЗаписатьОтчет(Запрос)
	
	ТелоДД = Запрос.ПолучитьТелоКакДвоичныеДанные();
	ТелоДД = РегистрацияОшибок.ПрочитатьСообщениеMultipart(Запрос.Заголовки, ТелоДД);
		
	Попытка						
		РегистрацияОшибок.ОбработатьОтчетОбОшибке(ТелоДД);			
		Возврат Новый HTTPСервисОтвет(200);				
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
				
		ОшибкаПоУмолчанию = РегистрацияОшибок.СоздатьОшибкуПоУмолчанию();
		РаботаСФайлами.ЗагрузитьДвоичныеДанныеВФайлы(ТелоДД, "Ошибка_"+Формат(ТекущаяДатаСеанса(), "ДФ=dd_MM_yyyy;"), ".zip", ОшибкаПоУмолчанию);
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("ОшибкаPushReport", 
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
					
		Возврат Ответ;
	КонецПопытки;
	
КонецФункции

Функция getInfoПолучитьИнформацию(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.ОткрытьПоток(Ответ.ПолучитьТелоКакПоток());
	
	Структура = Новый Структура;
	Структура.Вставить("needSendReport", Истина);
	
	ТекстПользователю = Константы.НачальныйТекстОбОшибке.Получить();
	
	//ТекстПользователю = НСтр("ru = '<b>Для связи со специалистом сформируйте и отправьте отчет об ошибке.</b>'");	
	//ТекстПользователю = ТекстПользователю + Символы.ПС + НСтр("ru = ' - Специалисту будет отправлено сообщение с предложением помочь разобраться с проблемой.'");
	
	Структура.Вставить("userMessage", ТекстПользователю);
	
	ЗаписатьJSON(ЗаписьJSON, Структура);
	ЗаписьJSON.Закрыть();
	
	Возврат Ответ;
	
КонецФункции



