
Функция pushReportЗаписатьОтчет(Запрос)
	ТелоДД = Запрос.ПолучитьТелоКакДвоичныеДанные();
	Попытка		
		РегистрацияОшибок.ОбработатьОтчетОбОшибке(ТелоДД);
		Возврат Новый HTTPСервисОтвет(200);			
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		РаботаСФайлами.ЗагрузитьДвоичныеДанныеВФайлы(
			РегистрацияОшибок.ПерекомпоноватьZip(ТелоДД), 
			"Ошибка_"+Формат(ТекущаяДатаСеанса(), "ДФ=dd_MM_yyyy;"), ".zip", 
			Константы.ПапкаФайловДляОшибок.Получить()
		);
		ЗаписьЖурналаРегистрации("ОшибкаPushReport", 
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
					
		Возврат Ответ;
	КонецПопытки;
	
КонецФункции

Функция getInfoПолучитьИнформацию(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.ОткрытьПоток(Ответ.ПолучитьТелоКакПоток());
	
	Структура = Новый Структура;
	Структура.Вставить("needSendReport", Истина);
	
	ТекстПользователю = НСтр("ru = '<b>Для связи со специалистом СФОРМИРУЙТЕ и отправьте отчет об ошибке.</b>'");	
	ТекстПользователю = ТекстПользователю + Символы.ПС + НСтр("ru = '- Специалисту будет отправлено сообщение с предложением помочь разобраться с проблемой.'");
	
	Структура.Вставить("userMessage", ТекстПользователю);
	
	ЗаписатьJSON(ЗаписьJSON, Структура);
	ЗаписьJSON.Закрыть();
	
	Возврат Ответ;
	
КонецФункции
