
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОшибкаСтруктура = Константы.ОшибкаПоУмолчанию.Получить().Получить();
	Если ОшибкаСтруктура <> Неопределено Тогда
		НаименованиеОшибки = ОшибкаСтруктура.Наименование;
		Проект = ОшибкаСтруктура.Проект;
		ВерсияПроекта = ОшибкаСтруктура.ВерсияПроекта;
		Сборка = ОшибкаСтруктура.Сборка;
		Кому = ОшибкаСтруктура.Кому;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ХЗОшибкаПоУмолчанию = Новый ХранилищеЗначения(
		Новый Структура("Наименование, Проект, ВерсияПроекта, Сборка, Кому", 
		НаименованиеОшибки, Проект, ВерсияПроекта, Сборка, Кому)
	);
	Константы.ОшибкаПоУмолчанию.Установить(ХЗОшибкаПоУмолчанию);	

КонецПроцедуры
